snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Маркировка_ПИ.ТипТекущегоУзла() <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;		
		Для Каждого МетаЗнач Из Метаданные.Перечисления.ВидыОперацийМаркировки.ЗначенияПеречисления Цикл
			ТекЗнач = Перечисления.ВидыОперацийМаркировки[МетаЗнач.имя];
			Если ТекЗнач = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда Продолжить КонецЕсли; 
					
			ДанныеВыбора.Добавить(ТекЗнач, ""+ТекЗнач);			
		КонецЦикла; 
		ДанныеВыбора.СортироватьПоПредставлению();		
	КонецЕсли; 
КонецПроцедуры
